simulations/icofoam_cases/3_branch_1_main_shifted_bed/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    wall
    {
        type            patch;
        physicalType    patch;
        nFaces          17052;
        startFace       272082;
    }
    surface
    {
        type            patch;
        physicalType    patch;
        nFaces          3600;
        startFace       289134;
    }
    main_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          24;
        startFace       292734;
    }
    branch_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          72;
        startFace       292758;
    }
    branch_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          72;
        startFace       292830;
    }
    main_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          24;
        startFace       292902;
    }
)

// ************************************************************************* //
